app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "uid", "provider", "facebook_url", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def login_via_social_media
    user = params
    byebug
    user = User.create_from_provider(user)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]
---
  def create
  	user = User.find_by(email: params[:session][:email].downcase)