app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update
		@user = User.find(params[:id])
		p params
		if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "facebook_url" = ?, "google_url" = ?, "instagram" = ?, "twitter" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["facebook_url", ""], ["google_url", ""], ["instagram", ""], ["twitter", ""], ["updated_at", "2015-07-03 22:45:37.954004"], ["id", 2]]